## Directions for running SQL in Jupyter

In [1]:
# Import libraries
import pandas as pd
import sqlite3
import sql

In [2]:
# Install the iPython-sql library
!pip install ipython-sql

Requirement already satisfied: ipython-sql in c:\users\vreed\anaconda3\lib\site-packages (0.4.0)
Requirement already satisfied: ipython>=1.0 in c:\users\vreed\anaconda3\lib\site-packages (from ipython-sql) (7.12.0)
Requirement already satisfied: six in c:\users\vreed\anaconda3\lib\site-packages (from ipython-sql) (1.14.0)
Requirement already satisfied: prettytable<1 in c:\users\vreed\anaconda3\lib\site-packages (from ipython-sql) (0.7.2)
Requirement already satisfied: ipython-genutils>=0.1.0 in c:\users\vreed\anaconda3\lib\site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: sqlparse in c:\users\vreed\anaconda3\lib\site-packages (from ipython-sql) (0.3.1)
Requirement already satisfied: sqlalchemy>=0.6.7 in c:\users\vreed\anaconda3\lib\site-packages (from ipython-sql) (1.3.13)
Requirement already satisfied: pygments in c:\users\vreed\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (2.5.2)
Requirement already satisfied: jedi>=0.10 in c:\users\vreed\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.14.1)
Requirement already satisfied: pickleshare in c:\users\vreed\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.7.5)
Requirement already satisfied: backcall in c:\users\vreed\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.1.0)
Requirement already satisfied: colorama in c:\users\vreed\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.4.3)
Requirement already satisfied: decorator in c:\users\vreed\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (4.4.1)
Requirement already satisfied: prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0 in c:\users\vreed\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (3.0.3)
Requirement already satisfied: traitlets>=4.2 in c:\users\vreed\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (4.3.3)
Requirement already satisfied: setuptools>=18.5 in c:\users\vreed\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (45.2.0.post20200210)
Requirement already satisfied: parso>=0.5.0 in c:\users\vreed\anaconda3\lib\site-packages (from jedi>=0.10->ipython>=1.0->ipython-sql) (0.5.2)
Requirement already satisfied: wcwidth in c:\users\vreed\anaconda3\lib\site-packages (from prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0->ipython>=1.0->ipython-sql) (0.1.8)

In [3]:
# We will sqlite3 library and create a connection
cnn = sqlite3.connect('jupyter_sql_tutorial.db')

In [4]:
# Load the SQL module to iPython
%load_ext sql

In [5]:
%sql sqlite:///jupyter_sql_tutorial.db

## Selecting Columns

In [6]:
%%sql

SELECT 'SQL'
AS result;

 * sqlite:///jupyter_sql_tutorial.db
Done.

[('SQL',)]

In [7]:
%%sql

SELECT * 
FROM Sheborgs;

 * sqlite:///jupyter_sql_tutorial.db
Done.

[(0, 'Alita', 18, 'Cyborg World', 8),
 (1, 'Cortana', 21, 'Halo', 9),
 (2, 'Major', 35, 'Ghost in the Shell', 10),
 (3, 'Seven of Nine', 24, 'Voyager', 9.5)]

In [8]:
%%sql

SELECT DISTINCT age
FROM Sheborgs;

 * sqlite:///jupyter_sql_tutorial.db
Done.

[(18,), (21,), (35,), (24,)]

In [9]:
%%sql

SELECT COUNT(*)
FROM Sheborgs;

 * sqlite:///jupyter_sql_tutorial.db
Done.

[(4,)]

In [10]:
%%sql

SELECT COUNT(DISTINCT space)
FROM Sheborgs;

 * sqlite:///jupyter_sql_tutorial.db
Done.

[(4,)]

## Filtering results

In [26]:
# %%sql

# INSERT INTO Sheborgs
# VALUES (3, 'Seven of Nine', 24, 'Voyager', 9.5);

 * sqlite:///jupyter_sql_tutorial.db
1 rows affected.

[]

In [12]:
%%sql
SELECT * FROM Sheborgs;

 * sqlite:///jupyter_sql_tutorial.db
Done.

[(0, 'Alita', 18, 'Cyborg World', 8),
 (1, 'Cortana', 21, 'Halo', 9),
 (2, 'Major', 35, 'Ghost in the Shell', 10),
 (3, 'Seven of Nine', 24, 'Voyager', 9.5),
 (3, 'Seven of Nine', 24, 'Voyager', 9.5)]

In [13]:
%%sql

ALTER TABLE Sheborgs DROP index;

 * sqlite:///jupyter_sql_tutorial.db
(sqlite3.OperationalError) near "DROP": syntax error
[SQL: ALTER TABLE Sheborgs DROP index;]
(Background on this error at: http://sqlalche.me/e/e3q8)

In [14]:
%%sql

SELECT * FROM Sheborgs WHERE age > 18;

 * sqlite:///jupyter_sql_tutorial.db
Done.

[(1, 'Cortana', 21, 'Halo', 9),
 (2, 'Major', 35, 'Ghost in the Shell', 10),
 (3, 'Seven of Nine', 24, 'Voyager', 9.5),
 (3, 'Seven of Nine', 24, 'Voyager', 9.5)]

In [15]:
%%sql
SELECT COUNT(*) FROM Sheborgs WHERE Beauty > 9;

 * sqlite:///jupyter_sql_tutorial.db
Done.

[(3,)]

In [16]:
%%sql

SELECT name, beauty 
FROM Sheborgs
WHERE age < 21;

 * sqlite:///jupyter_sql_tutorial.db
Done.

[('Alita', 8)]

In [34]:
# %%sql

# INSERT INTO Sheborgs
# VALUES (4, 'Pris', 3.75, 'Blade Runner', 8)

 * sqlite:///jupyter_sql_tutorial.db
1 rows affected.

[]

In [19]:
%%sql

SELECT * 
FROM Sheborgs;

 * sqlite:///jupyter_sql_tutorial.db
Done.

[(0, 'Alita', 18, 'Cyborg World', 8),
 (1, 'Cortana', 21, 'Halo', 9),
 (2, 'Major', 35, 'Ghost in the Shell', 10),
 (3, 'Seven of Nine', 24, 'Voyager', 9.5),
 (3, 'Seven of Nine', 24, 'Voyager', 9.5),
 (4, 'Pris', 3.75, 'Blade Runner', 8)]

In [20]:
%%sql

UPDATE Sheborgs
SET Space = 'Zalem'
WHERE Name = 'Alita';

 * sqlite:///jupyter_sql_tutorial.db
1 rows affected.

[]

##### Delete a specific row

In [33]:
# %%sql

# DELETE FROM Sheborgs
# WHERE age = 3.75;

 * sqlite:///jupyter_sql_tutorial.db
1 rows affected.

[]

In [35]:
%%sql

SELECT * 
FROM Sheborgs;

 * sqlite:///jupyter_sql_tutorial.db
Done.

[(0, 'Alita', 18, 'Zalem', 8),
 (1, 'Cortana', 21, 'Halo', 9),
 (2, 'Major', 35, 'Ghost in the Shell', 10),
 (3, 'Seven of Nine', 24, 'Voyager', 9.5),
 (4, 'Pris', 3.75, 'Blade Runner', 8)]

#### Simple filtering of all text

In [36]:
%%sql

SELECT Name
FROM Sheborgs
WHERE Age > 17;

 * sqlite:///jupyter_sql_tutorial.db
Done.

[('Alita',), ('Cortana',), ('Major',), ('Seven of Nine',)]

#### WHERE AND

In [37]:
%%sql

SELECT *
FROM Sheborgs
WHERE Age < 19
AND Beauty = 8;

 * sqlite:///jupyter_sql_tutorial.db
Done.

[(0, 'Alita', 18, 'Zalem', 8), (4, 'Pris', 3.75, 'Blade Runner', 8)]

#### WHERE AND OR

In [38]:
%%sql

SELECT * 
FROM Sheborgs
WHERE Beauty = 10
OR Name = 'Pris';

 * sqlite:///jupyter_sql_tutorial.db
Done.

[(2, 'Major', 35, 'Ghost in the Shell', 10),
 (4, 'Pris', 3.75, 'Blade Runner', 8)]

In [41]:
%%sql

SELECT * 
FROM Sheborgs
WHERE (Beauty = 10 OR Beauty = 9.5)
OR (Age = 3.75 OR Age = 18);

 * sqlite:///jupyter_sql_tutorial.db
Done.

[(0, 'Alita', 18, 'Zalem', 8),
 (2, 'Major', 35, 'Ghost in the Shell', 10),
 (3, 'Seven of Nine', 24, 'Voyager', 9.5),
 (4, 'Pris', 3.75, 'Blade Runner', 8)]